<?php

/**
 *  Тут можна ЛИШЕ ДОДАВАТИ НОВІ ЗНАЧЕННЯ, або міняти описи існуючих. Не видаляй
 */
return [
    
    // Перелік полів, на які можна давати текстові відповіді:
    "text_pages" => [
        "adresses", "contacts", "other_info", "decision", "resume", "weaknesses", 'trust_in_person', 'trust_in_me', 'dangerous', 'respect_in_me', 'benefits_for_me', "potential_contributions", "personal_resources", "vibe", "content_preferences"
    ],

    "pages_description" => [
        "resume" => [
            'field' => 'resume',
            'title' => 'Резюме:',
            'description' => 'Коротко про те, як взаємодіяти з цією людиною. Якщо людина робила мені добро, або зло - це мати бути тут коротко, щоб розуміти причину мого ставлення.'
        ],
        'decision' => [
            'field' => 'decision',
            'title' => 'Рішення:',
            'description' => 'Чи хочу я цю людину в своєму житті? Варто чи ні мати стосунки з цією людиною.'
        ],
        'contacts' => [
            'field' => 'contacts',
            'title' => 'Контакти та адреси:',
            'description' => "Всі способи зв'язатись з людиною. Соціальні мережі."
        ],
        'personal_resources' => [
            'field' => 'personal_resources',
            'title' => 'Що ця людина може мені дати?',
            'description' => "Чим ця людина корисна? До яких ресурсів ця людина має доступ? Що я хочу від неї отримати. Нічого? секс, гроші, повагу?"
        ],
        'potential_contributions' => [
            'field' => 'potential_contributions',
            'title' => 'Що я можу дати?',
            'description' => "Кількість добра, яку я можу дати цій людині. Якщо людина робить мені зло, то на нього слід відповідати злом. Лише я вирішую на скільки я готовий вкластись і ні копійкою більше."
        ],
        'vibe' => [
            'field' => 'vibe',
            'title' => 'Який вайб випромінює:',
            'description' => "Як я почуваю себе в її присутності? Що я відчуваю після спілкування з цією людиною?"
        ],
        'weaknesses' => [
            'field' => 'weaknesses',
            'title' => 'Слабкості:',
            'description' => "Чим можна надавити, щоб прожати цю людину?"
        ],
        'content_preferences' => [
            'field' => 'content_preferences',
            'title' => 'Який контент споживає:',
            'description' => "Хто є кумиром людини? Ким ця людина захоплюється? Що її вражає?"
        ],
        'other_info' =>  [
            'field' => 'other_info',
            'title' => 'Усі інші відомості про людину:',
            'description' => "Що ще я дізнався? Сюди все, що не входить у попередні секції. Не треба робити цю програму надто великою. Тут достатньо всього.<br><br>Файли і зображення можна заливати на гугл диск і відкривати доступ за посиланням, а тут саме посилання."
        ],
        'weight' => [
            'field' => 'weight',
            'title' => 'Вага у суспільстві',
            'description' => ""
        ],
        'circle' => [
            'field' => 'circle',
            'title' => 'Круг:',
            'description' => ""
        ],
        'religion' => [
            'field' => 'religion',
            'title' => 'Релігійні погляди:',
            'description' => ""
        ]
        
    ],

    'gender' => [
        0 => "Жінка", 
        1 => "Чоловік", 
    ],

    // Рішення: Чи хочу я цю людину в своєму житті? Варто чи ні мати стосунки з цією людиною:
    'decision' => [
        0 => "Невідомо", 
        1 => "Жодних справ з цією людиною", 
        2 => "Краще уникати", 
        3 => "Нейтрально",
        4 => "Краще бути в контакті",
        5 => "З цією людиною вигідно мати справу",
        6 => "Дуже важлива для мене людина"
    ],
    
    // Вага у суспільстві:
    'weight' => [ 
        0 => "Невідомо", 
        1 => "Незначна людина", 
        2 => "Має невеликий вплив", 
        3 => "Має значний вплив", 
        4 => "Можновладець",
    ],

    // Релігійні погляди:
    'religion' => [ 
        0 => "Невідомо", 
        1 => "Віруючий", 
        2 => "Фанатик", 
        3 => "Сумнівається", 
        3 => "Невіруючий", 
    ],

    // Круг:
    'circle' => [ 
        0 => "Невідомо", 
        1 => "Близька людина", 
        2 => "Дальня людина", 
        3 => "Нейтральна людина", 
        4 => "Ворожа людина"
    ],

    // Політичні погляди:
    'wing' => [
        0 => "Невідомо", 
        1 => "Ліві", 
        2 => "Праві", 
        3 => "Центристські"
    ],

    // radicalism
    'radicalism' => [
        0 => "Невідомо", 
        1 => "Помірковані", 
        2 => "Радикальні"
    ],

    // Чи довіряю я цій людині
    'trust_in_person' => [ 
        0 => "Невідомо", 
        1 => "Не довіряю", 
        2 => "Швидше ні", 
        3 => "Нейтрально", 
        4 => "Швидше так",
        5 => "Довіряю",
    ],

    // Чи відчуваю Я, що людина мені довіряє?
    'trust_in_me' => [ 
        0 => "Невідомо", 
        1 => "Не довіряє", 
        2 => "Швидше ні", 
        3 => "Нейтрально", 
        4 => "Швидше так",
        5 => "Довіряє",
    ],

    // На скільки ця людина є небезпечною для мене
    'dangerous' => [ 
        0 => "Невідомо", 
        1 => "Цілком безпечна", 
        2 => "Швидше безпечна", 
        3 => "Нейтральна", 
        4 => "Може бути небезпечною",
        5 => "Небезпечна!",
    ],

    // Чи відчуваю я повагу до себе?
    'respect_in_me' => [ 
        0 => "Невідомо", 
        1 => "Зневажає", 
        2 => "Мало поваги", 
        3 => "Нейтрально", 
        4 => "Виявляє повагу",
        5 => "Поважає",
    ],

    // Користь для мене
    'benefits_for_me' => [ 
        0 => "Невідомо", 
        1 => "Жодної користі", 
        2 => "Мало користі",  
        3 => "Багато користі",
    ]

]; 
