<?php

/**
 *  Тут можна ЛИШЕ ДОДАВАТИ НОВІ ЗНАЧЕННЯ, або міняти описи існуючих. Не видаляй
 */
return [
    
    // Рішення: Чи хочу я цю людину в своєму житті? Варто чи ні мати стосунки з цією людиною:
    'decision' => [
        0 => "Невідомо", 
        1 => "Жодних справ з цією людиною", 
        2 => "Краще уникати", 
        3 => "Нейтрально",
        4 => "Краще бути в контакті",
        5 => "З цією людиною вигідно мати справу",
        6 => "Дуже важлива для мене людина"
    ],
    
    // Вага у суспільстві:
    'weight' => [ 
        0 => "Невідомо", 
        1 => "Незначна людина", 
        2 => "Має невеликий вплив", 
        3 => "Має значний вплив", 
        4 => "Можновладець",
    ],

    // Релігійні погляди:
    'religion' => [ 
        0 => "Невідомо", 
        1 => "Атеїст", 
        2 => "Християнин", 
        3 => "Мусульманин"
    ],

    // Круг:
    'circle' => [ 
        0 => "Невідомо", 
        1 => "Близька людина", 
        2 => "Дальня людина", 
        3 => "Нейтральна людина", 
        4 => "Ворожа людина"
    ],

    // Політичні погляди:
    'wing' => [
        0 => "Невідомо", 
        1 => "Ліві", 
        2 => "Праві", 
        3 => "Центристські"
    ],

    // radicalism
    'radicalism' => [
        0 => "Невідомо", 
        1 => "Помірковані", 
        2 => "Радикальні"
    ],

    // Чи довіряю я цій людині
    'trust_in_person' => [ 
        0 => "Невідомо", 
        1 => "Не довіряю", 
        2 => "Швидше ні", 
        3 => "Нейтрально", 
        4 => "Швидше так",
        5 => "Довіряю",
    ],

    // Чи відчуваю Я, що людина мені довіряє?
    'trust_in_me' => [ 
        0 => "Невідомо", 
        1 => "Не довіряє", 
        2 => "Швидше ні", 
        3 => "Нейтрально", 
        4 => "Швидше так",
        5 => "Довіряє",
    ],

    // На скільки ця людина є небезпечною для мене
    'dangerous' => [ 
        0 => "Невідомо", 
        1 => "Цілком безпечна", 
        2 => "Швидше безпечна", 
        3 => "Нейтральна", 
        4 => "Може бути небезпечною",
        5 => "Небезпечна!",
    ],

    // Чи відчуваю я повагу до себе?
    'respect_in_me' => [ 
        0 => "Невідомо", 
        1 => "Зневажає", 
        2 => "Мало поваги", 
        3 => "Нейтрально", 
        4 => "Виявляє повагу",
        5 => "Поважає",
    ],

    // Користь для мене
    'benefits_for_me' => [ 
        0 => "Невідомо", 
        1 => "Жодної користі", 
        2 => "Мало користі",  
        3 => "Багато користі",
    ]

]; 
